import * as Knex from 'knex';

export async function seed(knex: Knex): Promise<void> {
  // Deletes ALL existing entries
  await knex('tours').del();

  // Inserts seed entries
  await knex('tours').insert([
    // Гастрономические туры
    {
      id: 0,
      categoryId: 0,
      title: 'Русская Тоскана',
      subTitle: `Продегустировать молодой рислинг и выдержанное   сливочное шардоне, сфотографироваться около огромных дубовых бочек, устроить пикник между рядов виноградной лозы`,
      place: 'Русская Тоскана',
      description: `Черноморское побережье в районе Анапы,   Геленджика и Новороссийска называют русской Тосканой и русским Бордо. Вас ожидают ужины в уютных ресторанчиках с видом на виноградники в лучах закатного солнца, экскурсии на улиточную ферму и небольшую пасеку, прогулки по морской набережной и озеру с болотными кипарисами,  посещение топовых виноделен, признанных даже заграничными экспертами. Там покажут, как рождается красностоп, саперави и сира, пустят в цеха и погреба с глиняными     амфорами и стальными емкостями для винификации, научат правильно «крутить» вино в бокале и расскажут, что с чем сочетать.`,
      price: 22500,
      duration: 4,
      country: `Россия`,
      travelersCount: 10,
      startDate: '2022-06-01',
    },
    {
      id: 1,
      categoryId: 0,
      title: `Сан-Джиминьяно: частный органический винный тур и дегустация`,
      subTitle: `Наслаждайтесь частной экскурсией по семейной органической винодельне. Попробуйте органические вина и масла Evo и выберите типичную тосканскую или трюфельную еду.`,
      place: `Сан-Джиминьяно`,
      description: `Наслаждайтесь 1,5-часовым посещением Podere la Marronaia, небольшой семейной фермы в Сан-Джиминьяно, посвященной выращиванию винограда и оливок, а также производству органических вин и оливкового масла экстра-класса. Совершите короткую прогулку от центра Сан-Джиминьяно до Соста Алле Колонн, подвала и места дегустации. Ваш визит будет не просто дегустацией вин, но и знакомством с миром тосканских вин. Испытайте страсть семьи к земле и ее продукции.`,
      price: 40000,
      duration: 2,
      country: `Италия`,
      travelersCount: 20,
      startDate: '2022-06-01',
    },
    {
      id: 2,
      categoryId: 0,
      title: `Вардзия и месхетинская кухня`,
      subTitle: `Попробовать домашние местные блюда и увидеть высеченный в скале комплекс`,
      place: `Вардзия`,
      description: `Вы познакомитесь с кулинарными традициями южной Грузии,  заглянете в гости к местным, где для вас накроют стол сами хозяева, и отведаете блюда, которые они готовят по переходящим из поколения в поколение рецептам. Среди них: хинкали из вяленого мяса, суп тутмаджи, месхетинские хачапури, када и свежий хлеб, испеченный в традиционной 150-летней печи пурне. Исследуете извилистые туннели пещерного комплекса Вардзия, узнаете о правлении царицы Тамары, расцвете и тяжелых периодах истории Грузии и поймете, что такое настоящее грузинское гостеприимство.`,
      price: 52500,
      duration: 2,
      country: `Грузия`,
      travelersCount: 24,
      startDate: '2022-06-01',
    },
    {
      id: 3,
      categoryId: 0,
      title: `На север! Гастро-тур в Териберку`,
      subTitle: `Проникнуться красотой суровых пейзажей, побывать в местах, где снимали “Левиафан” и распробовать с пылу с жару блюда из местных продуктов`,
      place: `Териберку`,
      description: `Мы отправимся на край земли, в холодный поселок Териберка, которая очнулась знаменитой после выхода фильма Звягинцева «Левиафан». Вас ждет берег, усеянный камнями, напоминающий драконьи яйца. Вы заглянете в пещеру и дойдете до обледеневшего водопада, падающего в океан с поворотом на 90 градусов. Осмотрите священные сейды и узнаете об их предназначении. А на кладбище старых кораблей сделаете необыкновенные снимки. А мы добавим к этим впечатлениям гастрономические и при вас приготовим блюда из оленины и морепродуктов!`,
      price: 46000,
      duration: 7,
      country: `Россия`,
      travelersCount: 12,
      startDate: '2022-06-01',
    },
    {
      id: 4,
      categoryId: 0,
      title: `Узбекский плов: готовим и едим!`,
      subTitle: `Мастер-класс, ужин и погружение в аутентичный сельский быт в гостях у местных под Самаркандом.`,
      place: `Самарканд`,
      description: `Невозможно до конца понять Узбекистан, не познав его яркие вкусы! На экскурсии вы познакомитесь с главным героем национальной кухни — пловом. Мастер-класс по приготовлению этого аппетитного блюда пройдет в традиционном селе под Самаркандом — так вы увидите быт узбеков и проникнетесь настоящим колоритом страны. В гостях у местной семьи вы приготовите плов под руководством хозяина дома, узнаете секреты мастерства, попробуете ароматный хлеб, поужинаете за беседами о местной жизни — и почувствуете гостеприимство Узбекистана.`,
      price: 46000,
      duration: 2,
      country: `Узбекистан`,
      travelersCount: 18,
      startDate: '2022-06-01',
    },

    // Йога-Туры
    {
      id: 5,
      categoryId: 1,
      title: `Выход на новый уровень на Алтае`,
      subTitle: `Совместить сплавы по горной реке, трекинги по красивейшим местам Алтая с релаксацией, созерцательными практиками и медитациями.`,
      place: `Горный Алтай`,
      description: `Горный Алтай — одно из самых сакральных мест России. Подножие  Белухи и Аккемское озеро это самое сердце Алтая, сердце России и Сердце Земли. Здесь меняются мысли и способ мышления, после поездки сюда изменяется жизнь и воплощаются мечты!! Мы будем практиковать йогу, практиковать созерцание и медитации. В программе есть несложный сплав по реке Катунь, ежедневные трекинги, трансформационные игры и нескучные семинары.`,
      price: 38000,
      duration: 20,
      country: `Россия`,
      travelersCount: 30,
      startDate: '2022-06-01',
    },
    {
      id: 6,
      categoryId: 1,
      title: `ЭКО-Перезагрузка в Крыму`,
      subTitle: `Компания единомышленников, чистый воздух, несложный треккинг, асаны и медитация на вершине`,
      place: `Крым`,
      description: `Этот тур - перезагрузка, цель которого - выдохнуть, перезагрузиться, наполнится новыми силами. Нас ждет природа Крыма, море, горы, походы, экскурсии, йога, творчество, общение с единомышленниками. Мы будем делать утренние практики, гулять по природе, пить чай и вести задушевные разговоры, париться в бане, наслаждаться шумом прибоя, лесными тропинками, ослепительно красивыми горными вершинами и долинами Крыма. Полюбуемся на дворцы и парки царских вельмож в Ялте. Посетим места силы Крыма и погрузимся внутрь себя, чтобы получить ответы и обрести ясность.`,
      price: 45000,
      duration: 14,
      country: `Россия`,
      travelersCount: 37,
      startDate: '2022-06-01',
    },
  ]);
}
